In [1]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt

import sklearn
from sklearn import cluster

%matplotlib inline

In [2]:
xls = pd.ExcelFile('/Users/anjiang/Desktop/FP&A Case Study(1).xlsx')
df = pd.read_excel(xls, 'Data')

In [3]:
df.head()

,Time of customer support inbound contact,Order Id,Customer rating,Region
0,2014-06-02 04:23:16 UTC,233599337,5,Midwest
1,2014-06-02 03:57:50 UTC,233599376,5,Midwest
2,2014-06-02 02:52:38 UTC,233599328,5,Midwest
3,2014-06-02 02:52:04 UTC,233599070,5,Midwest
4,2014-06-02 02:41:43 UTC,233599100,5,Midwest

In [4]:
df = df.rename(columns={"Time of customer support inbound contact": "Time", "Order Id": "Order", "Customer rating": "Rating"})

In [5]:
df.describe()

              Order        Rating
count  1.495700e+04  14957.000000
mean   1.041118e+08      4.558200
std    1.159783e+08      1.002157
min    2.080560e+05      0.000000
25%    2.329820e+05      5.000000
50%    2.458290e+05      5.000000
75%    2.335890e+08      5.000000
max    2.336147e+08      5.000000

In [6]:
df.groupby(["Region"])["Rating"].mean()

Region
East Coast     4.431008
Midwest        4.711820
West Coast     4.661959
West Coast     2.678841
Name: Rating, dtype: float64

In [7]:
df.groupby(["Region"]).Order.size()

Region
East Coast     1290
Midwest        6430
West Coast     6443
West Coast      794
Name: Order, dtype: int64

In [8]:
df.groupby(["Order"]).size().sort_values(ascending=False).head(30)

Order
237775       6
246371       6
233598760    6
228263       5
226403       5
233593904    4
237047       4
225504       4
225930       4
226459       4
233595140    4
227877       4
233582839    4
233591621    4
238011       4
228376       4
232485       4
233593515    4
233587170    4
233584871    4
233593612    4
244584       4
233585564    4
247296       4
241730       4
245829       4
233585093    4
233585002    3
233593180    3
237147       3
dtype: int64

In [9]:
df[df.Order==237775]

                         Time   Order  Rating      Region
7665  2014-05-12 21:53:37 UTC  237775       3  East Coast
7666  2014-05-12 21:53:37 UTC  237775       3  East Coast
7667  2014-05-12 21:53:37 UTC  237775       3  East Coast
7668  2014-05-12 21:53:37 UTC  237775       3  East Coast
7669  2014-05-12 21:53:37 UTC  237775       3  East Coast
7670  2014-05-12 21:53:37 UTC  237775       3  East Coast

In [10]:
df[df.Order==246371]

                          Time   Order  Rating      Region
13927  2014-05-19 00:44:44 UTC  246371       2  West Coast
13928  2014-05-19 00:44:44 UTC  246371       2  West Coast
13929  2014-05-19 00:44:44 UTC  246371       2  West Coast
13930  2014-05-19 00:44:44 UTC  246371       2  West Coast
13931  2014-05-19 00:44:44 UTC  246371       2  West Coast
13932  2014-05-19 00:44:44 UTC  246371       2  West Coast

In [11]:
df[df.Order==233598760]

                         Time      Order  Rating   Region
6297  2014-06-02 01:07:38 UTC  233598760       1  Midwest
6298  2014-06-02 01:07:38 UTC  233598760       1  Midwest
6299  2014-06-02 01:07:38 UTC  233598760       1  Midwest
6300  2014-06-02 01:07:38 UTC  233598760       1  Midwest
6301  2014-06-02 01:07:38 UTC  233598760       1  Midwest
6302  2014-06-02 01:07:38 UTC  233598760       1  Midwest

In [12]:
df[df.Order==228263]

                          Time   Order  Rating      Region
12062  2014-05-07 01:16:55 UTC  228263       5  West Coast
12063  2014-05-07 01:16:55 UTC  228263       5  West Coast
12064  2014-05-07 01:16:55 UTC  228263       5  West Coast
12065  2014-05-07 01:16:55 UTC  228263       5  West Coast
12066  2014-05-07 01:16:55 UTC  228263       5  West Coast

In [13]:
df[df.Order==226403]

                          Time   Order  Rating      Region
13972  2014-05-06 03:08:25 UTC  226403       2  West Coast
13973  2014-05-06 03:08:25 UTC  226403       2  West Coast
13974  2014-05-06 03:08:25 UTC  226403       2  West Coast
13975  2014-05-06 03:08:25 UTC  226403       2  West Coast
13976  2014-05-06 03:08:25 UTC  226403       2  West Coast

In [14]:
df[df.Order==208056]

                          Time   Order  Rating      Region
12112  2014-05-06 21:04:48 UTC  208056       5  West Coast

In [15]:
df[df.Order==232485]

                          Time   Order  Rating      Region
11608  2014-05-10 00:59:31 UTC  232485       5  West Coast
11609  2014-05-10 00:53:01 UTC  232485       5  West Coast
11613  2014-05-10 00:36:03 UTC  232485       5  West Coast
11615  2014-05-10 00:19:26 UTC  232485       5  West Coast

In [16]:
df["Date"] = 0
df["Hour"] = 0

In [17]:
for i in range(len(df)):
    df["Date"].iloc[i] = df["Time"].iloc[i].split(" ")[0]
    df["Hour"].iloc[i] = df["Time"].iloc[i].split(" ")[1].split(":")[0]

/Users/anjiang/opt/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:205: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [18]:
df.head()

                      Time      Order  Rating   Region        Date Hour
0  2014-06-02 04:23:16 UTC  233599337       5  Midwest  2014-06-02   04
1  2014-06-02 03:57:50 UTC  233599376       5  Midwest  2014-06-02   03
2  2014-06-02 02:52:38 UTC  233599328       5  Midwest  2014-06-02   02
3  2014-06-02 02:52:04 UTC  233599070       5  Midwest  2014-06-02   02
4  2014-06-02 02:41:43 UTC  233599100       5  Midwest  2014-06-02   02

In [19]:
df1 = df.groupby(["Date"]).Rating.mean()
df1

Date
2014-05-01    4.563265
2014-05-02    4.686016
2014-05-03    4.648438
2014-05-04    4.449821
2014-05-05    4.437117
2014-05-06    4.552063
2014-05-07    4.490783
2014-05-08    4.496259
2014-05-09    4.640845
2014-05-10    4.591981
2014-05-11    4.501866
2014-05-12    4.584871
2014-05-13    4.519011
2014-05-14    4.572840
2014-05-15    4.524390
2014-05-16    4.610687
2014-05-17    4.573441
2014-05-18    4.508604
2014-05-19    4.481216
2014-05-20    4.500956
2014-05-21    4.587601
2014-05-22    4.616162
2014-05-23    4.623223
2014-05-24    4.632099
2014-05-25    4.620968
2014-05-26    4.730077
2014-05-27    4.563895
2014-05-28    4.423892
2014-05-29    4.567059
2014-05-30    4.650442
2014-05-31    4.669834
2014-06-01    4.585977
2014-06-02    4.317992
Name: Rating, dtype: float64

In [20]:
df1 >= 4.558200 # check if it's above the average rating

Date
2014-05-01     True
2014-05-02     True
2014-05-03     True
2014-05-04    False
2014-05-05    False
2014-05-06    False
2014-05-07    False
2014-05-08    False
2014-05-09     True
2014-05-10     True
2014-05-11    False
2014-05-12     True
2014-05-13    False
2014-05-14     True
2014-05-15    False
2014-05-16     True
2014-05-17     True
2014-05-18    False
2014-05-19    False
2014-05-20    False
2014-05-21     True
2014-05-22     True
2014-05-23     True
2014-05-24     True
2014-05-25     True
2014-05-26     True
2014-05-27     True
2014-05-28    False
2014-05-29     True
2014-05-30     True
2014-05-31     True
2014-06-01     True
2014-06-02    False
Name: Rating, dtype: bool

In [21]:
df.groupby(["Date"]).size()

Date
2014-05-01    245
2014-05-02    379
2014-05-03    512
2014-05-04    558
2014-05-05    652
2014-05-06    509
2014-05-07    434
2014-05-08    401
2014-05-09    426
2014-05-10    424
2014-05-11    536
2014-05-12    542
2014-05-13    526
2014-05-14    405
2014-05-15    410
2014-05-16    393
2014-05-17    497
2014-05-18    523
2014-05-19    559
2014-05-20    523
2014-05-21    371
2014-05-22    396
2014-05-23    422
2014-05-24    405
2014-05-25    372
2014-05-26    389
2014-05-27    493
2014-05-28    519
2014-05-29    425
2014-05-30    452
2014-05-31    421
2014-06-01    599
2014-06-02    239
dtype: int64

In [22]:
df2 = df.groupby(["Hour"]).Rating.mean()
df2

Hour
00    4.546471
01    4.512761
02    4.550926
03    4.504286
04    4.560096
05    4.366379
06    3.767857
07    2.444444
08    3.333333
09    2.166667
11    3.000000
12    2.571429
13    4.721519
14    4.701493
15    4.542683
16    4.541814
17    4.533201
18    4.601525
19    4.607276
20    4.591155
21    4.599479
22    4.583866
23    4.591236
Name: Rating, dtype: float64

In [23]:
df2 >= 4.558200

Hour
00    False
01    False
02    False
03    False
04     True
05    False
06    False
07    False
08    False
09    False
11    False
12    False
13     True
14     True
15    False
16    False
17    False
18     True
19     True
20     True
21     True
22     True
23     True
Name: Rating, dtype: bool

In [24]:
df.groupby(["Hour"]).size()

Hour
00    1431
01    1293
02    1080
03     700
04     416
05     232
06      56
07       9
08       3
09       6
11       3
12       7
13      79
14     268
15     492
16     849
17    1009
18    1049
19    1072
20    1108
21    1151
22    1252
23    1392
dtype: int64